Masmiseim36/nxpSDK/boards/mimxrt685audevk/mbedtls3x_examples/mbedtls3x_benchmark/benchmark.c
/*
 *  Benchmark demonstration program
 *
 *  Copyright The Mbed TLS Contributors
 *  SPDX-License-Identifier: Apache-2.0
 *  Copyright 2020 NXP. Not a Contribution
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

#define MBEDTLS_ALLOW_PRIVATE_ACCESS

#include "mbedtls/build_info.h"
#if defined(MBEDTLS_PLATFORM_C)

#if defined(MCUX_MBEDTLS)

#include "mbedtls/version.h"
#include <stdio.h>
#include "fsl_debug_console.h"
#include "fsl_clock.h"
#include "board.h"
#include "app.h"

#define mbedtls_printf   PRINTF
#define mbedtls_snprintf snprintf
#define mbedtls_exit(x) \
    do                  \
    {                   \
    } while (1)
#define mbedtls_free free
#define fflush(x) \
    do            \
    {             \
    } while (0)

#else
#include "mbedtls/platform.h"
#endif
#else
#include <stdio.h>
#include <stdlib.h>
#define mbedtls_exit         exit
#define mbedtls_printf       printf
#define mbedtls_snprintf     snprintf
#define mbedtls_free         free
#define mbedtls_exit         exit
#define MBEDTLS_EXIT_SUCCESS EXIT_SUCCESS
#define MBEDTLS_EXIT_FAILURE EXIT_FAILURE
#endif

#if !defined(MBEDTLS_TIMING_C) && !defined(MCUX_MBEDTLS)
int main(void)
{
    mbedtls_printf("MBEDTLS_TIMING_C not defined.\n");
    return (0);
}
#else

#include <string.h>
#include <stdlib.h>

#include "mbedtls/timing.h"

#include "mbedtls/md5.h"
#include "mbedtls/ripemd160.h"
#include "mbedtls/sha1.h"
#include "mbedtls/sha256.h"
#include "mbedtls/sha512.h"

#include "mbedtls/des.h"
#include "mbedtls/aes.h"
#include "mbedtls/aria.h"
#include "mbedtls/camellia.h"
#include "mbedtls/chacha20.h"
#include "mbedtls/gcm.h"
#include "mbedtls/ccm.h"
#include "mbedtls/chachapoly.h"
#include "mbedtls/cmac.h"
#include "mbedtls/poly1305.h"

#include "mbedtls/ctr_drbg.h"
#include "mbedtls/hmac_drbg.h"

#include "mbedtls/rsa.h"
#include "mbedtls/dhm.h"
#include "mbedtls/ecdsa.h"
#include "mbedtls/ecdh.h"

#include "mbedtls/error.h"

#ifndef asm
#define asm __asm
#endif

#if defined(MBEDTLS_MEMORY_BUFFER_ALLOC_C)
#include "mbedtls/memory_buffer_alloc.h"
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*
 * For heap usage estimates, we need an estimate of the overhead per allocated
 * block. ptmalloc2/3 (used in gnu libc for instance) uses 2 size_t per block,
 * so use that as our baseline.
 */
#define MEM_BLOCK_OVERHEAD (2 * sizeof(size_t))

/*
 * Size to use for the alloc buffer if MEMORY_BUFFER_ALLOC_C is defined.
 */
#define HEAP_SIZE          (1u << 16) /* 64k */

#define BUFSIZE       1024
#define HEADER_FORMAT "  %-24s :  "
#define TITLE_LEN     25

#define OPTIONS                                         \
    "md5, ripemd160, sha1, sha256, sha512,\n"           \
    "des3, des, camellia, chacha20,\n"                  \
    "aes_cbc, aes_gcm, aes_ccm, aes_xts, chachapoly,\n" \
    "aes_cmac, des3_cmac, poly1305\n"                   \
    "ctr_drbg, hmac_drbg\n"                             \
    "rsa, dhm, ecdsa, ecdh.\n"

#if defined(MBEDTLS_ERROR_C)
#define PRINT_ERROR                                  \
    mbedtls_strerror(ret, (char *)tmp, sizeof(tmp)); \
    mbedtls_printf("FAILED: %s\n", tmp);
#else
#define PRINT_ERROR mbedtls_printf("FAILED: -0x%04x\n", (unsigned int)-ret);
#endif

#define TIME_AND_TSC(TITLE, CODE)                                                                         \
    do                                                                                                    \
    {                                                                                                     \
        uint32_t ii, jj;                                                                                  \
        uint64_t tsc1, tsc2;                                                                              \
        int ret = 0;                                                                                      \
                                                                                                          \
        mbedtls_printf(HEADER_FORMAT, TITLE);                                                             \
        fflush(stdout);                                                                                   \
                                                                                                          \
        benchmark_mbedtls_set_alarm(1);                                                                   \
        tsc1 = benchmark_mbedtls_timing_hardclock();                                                      \
        for (ii = 1; ret == 0 && !benchmark_mbedtls_timing_alarmed; ii++)                                 \
        {                                                                                                 \
            ret = CODE;                                                                                   \
            benchmark_mbedtls_poll_alarm();                                                               \
        }                                                                                                 \
                                                                                                          \
        tsc2 = benchmark_mbedtls_timing_hardclock();                                                      \
        for (jj = 0; ret == 0 && jj < 1024; jj++)                                                         \
        {                                                                                                 \
            ret = CODE;                                                                                   \
        }                                                                                                 \
                                                                                                          \
        if (ret != 0)                                                                                     \
        {                                                                                                 \
            PRINT_ERROR;                                                                                  \
        }                                                                                                 \
        else                                                                                              \
        {                                                                                                 \
            mbedtls_printf("%6.2f KB/s,  %6.2f cycles/byte\r\n",                                          \
                           (ii * BUFSIZE / 1024) / (((double)(tsc2 - tsc1)) / CLOCK_GetCoreSysClkFreq()), \
                           (((double)(benchmark_mbedtls_timing_hardclock() - tsc2)) / (jj * BUFSIZE)));   \
        }                                                                                                 \
    } while (0)

#if defined(MBEDTLS_MEMORY_BUFFER_ALLOC_C) && defined(MBEDTLS_MEMORY_DEBUG)

/* How much space to reserve for the title when printing heap usage results.
 * Updated manually as the output of the following command:
 *
 *  sed -n 's/.*[T]IME_PUBLIC.*"\(.*\)",/\1/p' programs/test/benchmark.c |
 *      awk '{print length+2}' | sort -rn | head -n1
 *
 * This computes the maximum length of a title +2 (because we appends "/s").
 * (If the value is too small, the only consequence is poor alignement.) */
#define TITLE_SPACE 16

#define MEMORY_MEASURE_INIT                                      \
    size_t max_used, max_blocks, max_bytes;                      \
    size_t prv_used, prv_blocks;                                 \
    mbedtls_memory_buffer_alloc_cur_get(&prv_used, &prv_blocks); \
    mbedtls_memory_buffer_alloc_max_reset();

