Masmiseim36/nxpSDK/boards/mimxrt685audevk/mbedtls3x_examples/mbedtls3x_benchmark/benchmark.c
#define MEMORY_MEASURE_PRINT(title_len)                             \
    mbedtls_memory_buffer_alloc_max_get(&max_used, &max_blocks);    \
    ii = TITLE_SPACE > (title_len) ? TITLE_SPACE - (title_len) : 1; \
    while (ii--)                                                    \
        mbedtls_printf(" ");                                        \
    max_used -= prv_used;                                           \
    max_blocks -= prv_blocks;                                       \
    max_bytes = max_used + MEM_BLOCK_OVERHEAD * max_blocks;         \
    mbedtls_printf("%6u heap bytes", (unsigned)max_bytes);

#else
#define MEMORY_MEASURE_INIT
#define MEMORY_MEASURE_PRINT(title_len)
#endif

#define TIME_PUBLIC(TITLE, TYPE, CODE)                                                                                 \
    do                                                                                                                 \
    {                                                                                                                  \
        uint32_t ii;                                                                                                   \
        uint64_t tsc;                                                                                                  \
        int ret;                                                                                                       \
        MEMORY_MEASURE_INIT;                                                                                           \
                                                                                                                       \
        mbedtls_printf(HEADER_FORMAT, TITLE);                                                                          \
        fflush(stdout);                                                                                                \
        benchmark_mbedtls_set_alarm(3);                                                                                \
                                                                                                                       \
        ret = 0;                                                                                                       \
        tsc = benchmark_mbedtls_timing_hardclock();                                                                    \
        for (ii = 1; !benchmark_mbedtls_timing_alarmed && !ret; ii++)                                                  \
        {                                                                                                              \
            CODE;                                                                                                      \
            benchmark_mbedtls_poll_alarm();                                                                            \
        }                                                                                                              \
                                                                                                                       \
        if (ret == MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED)                                                           \
        {                                                                                                              \
            mbedtls_printf("Feature Not Supported. Skipping.\n");                                                      \
            ret = 0;                                                                                                   \
        }                                                                                                              \
        else if (ret != 0)                                                                                             \
        {                                                                                                              \
            PRINT_ERROR;                                                                                               \
        }                                                                                                              \
        else                                                                                                           \
        {                                                                                                              \
            mbedtls_printf("%6.2f " TYPE "/s",                                                                         \
                           ((double)ii) / ((benchmark_mbedtls_timing_hardclock() - tsc) / CLOCK_GetCoreSysClkFreq())); \
            MEMORY_MEASURE_PRINT(sizeof(TYPE) + 1);                                                                    \
            mbedtls_printf("\r\n");                                                                                    \
        }                                                                                                              \
    } while (0)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static int myrand(void *rng_state, unsigned char *output, size_t len)
{
    size_t use_len;
    int rnd;

    if (rng_state != NULL)
        rng_state = NULL;

    while (len > 0)
    {
        use_len = len;
        if (use_len > sizeof(int))
            use_len = sizeof(int);

        rnd = rand();
        memcpy(output, &rnd, use_len);
        output += use_len;
        len -= use_len;
    }

    return (0);
}

#define CHECK_AND_CONTINUE(R)                                                   \
    {                                                                           \
        int CHECK_AND_CONTINUE_ret = (R);                                       \
        if (CHECK_AND_CONTINUE_ret == MBEDTLS_ERR_PLATFORM_FEATURE_UNSUPPORTED) \
        {                                                                       \
            mbedtls_printf("Feature not supported. Skipping.\n");               \
            continue;                                                           \
        }                                                                       \
        else if (CHECK_AND_CONTINUE_ret != 0)                                   \
        {                                                                       \
            mbedtls_exit(1);                                                    \
        }                                                                       \
    }

