Masmiseim36/nxpSDK/boards/mimxrt685audevk/mbedtls3x_examples/mbedtls3x_benchmark/benchmark.c
    mbedtls_printf("\n");

#if defined(MBEDTLS_MEMORY_BUFFER_ALLOC_C)
    mbedtls_memory_buffer_alloc_init(alloc_buf, sizeof(alloc_buf));
#endif
    memset(buf, 0xAA, sizeof(buf));
    memset(tmp, 0xBB, sizeof(tmp));

#if defined(MBEDTLS_MD5_C)
    if (todo.md5)
        TIME_AND_TSC("MD5", mbedtls_md5(buf, BUFSIZE, tmp));
#endif

#if defined(MBEDTLS_RIPEMD160_C)
    if (todo.ripemd160)
        TIME_AND_TSC("RIPEMD160", mbedtls_ripemd160(buf, BUFSIZE, tmp));
#endif

#if defined(MBEDTLS_SHA1_C)
    if (todo.sha1)
        TIME_AND_TSC("SHA-1", mbedtls_sha1(buf, BUFSIZE, tmp));
#endif

#if defined(MBEDTLS_SHA256_C)
    if (todo.sha256)
        TIME_AND_TSC("SHA-256", mbedtls_sha256(buf, BUFSIZE, tmp, 0));
#endif

#if defined(MBEDTLS_SHA512_C)
    if (todo.sha512)
        TIME_AND_TSC("SHA-512", mbedtls_sha512(buf, BUFSIZE, tmp, 0));
#endif

#if defined(MBEDTLS_DES_C)
#if defined(MBEDTLS_CIPHER_MODE_CBC)
    if (todo.des3)
    {
        mbedtls_des3_context des3;
        mbedtls_des3_init(&des3);
        if (mbedtls_des3_set3key_enc(&des3, tmp) != 0)
            mbedtls_exit(1);
        TIME_AND_TSC("3DES", mbedtls_des3_crypt_cbc(&des3, MBEDTLS_DES_ENCRYPT, BUFSIZE, tmp, buf, buf));
        mbedtls_des3_free(&des3);
    }

    if (todo.des)
    {
        mbedtls_des_context des;
        mbedtls_des_init(&des);
        if (mbedtls_des_setkey_enc(&des, tmp) != 0)
            mbedtls_exit(1);
        TIME_AND_TSC("DES", mbedtls_des_crypt_cbc(&des, MBEDTLS_DES_ENCRYPT, BUFSIZE, tmp, buf, buf));
        mbedtls_des_free(&des);
    }

#endif /* MBEDTLS_CIPHER_MODE_CBC */
#if defined(MBEDTLS_CMAC_C)
    if (todo.des3_cmac)
    {
        unsigned char output[8];
        const mbedtls_cipher_info_t *cipher_info;

        memset(buf, 0, sizeof(buf));
        memset(tmp, 0, sizeof(tmp));

        cipher_info = mbedtls_cipher_info_from_type(MBEDTLS_CIPHER_DES_EDE3_ECB);

        TIME_AND_TSC("3DES-CMAC", mbedtls_cipher_cmac(cipher_info, tmp, 192, buf, BUFSIZE, output));
    }
#endif /* MBEDTLS_CMAC_C */
#endif /* MBEDTLS_DES_C */

#if defined(MBEDTLS_AES_C)
#if defined(MBEDTLS_CIPHER_MODE_CBC)
    if (todo.aes_cbc)
    {
        int keysize;
        mbedtls_aes_context aes;
        mbedtls_aes_init(&aes);
        for (keysize = 128; keysize <= 256; keysize += 64)
        {
#ifdef MBEDTLS_AES_ALT_NO_192
            if (keysize == 192)
            {
                continue;
            }
#endif
#ifdef MBEDTLS_AES_ALT_NO_256
            if (keysize == 256)
            {
                continue;
            }
#endif
            mbedtls_snprintf(title, sizeof(title), "AES-CBC-%d", keysize);

            memset(buf, 0, sizeof(buf));
            memset(tmp, 0, sizeof(tmp));
            CHECK_AND_CONTINUE(mbedtls_aes_setkey_enc(&aes, tmp, keysize));

            TIME_AND_TSC(title, mbedtls_aes_crypt_cbc(&aes, MBEDTLS_AES_ENCRYPT, BUFSIZE, tmp, buf, buf));
        }
        mbedtls_aes_free(&aes);
    }
#endif
#if defined(MBEDTLS_CIPHER_MODE_XTS)
    if (todo.aes_xts)
    {
        int keysize;
        mbedtls_aes_xts_context ctx;

        mbedtls_aes_xts_init(&ctx);
        for (keysize = 128; keysize <= 256; keysize += 128)
        {
#ifdef MBEDTLS_AES_ALT_NO_256
            if (keysize == 256)
            {
                continue;
            }
#endif
            mbedtls_snprintf(title, sizeof(title), "AES-XTS-%d", keysize);

            memset(buf, 0, sizeof(buf));
            memset(tmp, 0, sizeof(tmp));
            CHECK_AND_CONTINUE(mbedtls_aes_xts_setkey_enc(&ctx, tmp, keysize * 2));

            TIME_AND_TSC(title, mbedtls_aes_crypt_xts(&ctx, MBEDTLS_AES_ENCRYPT, BUFSIZE, tmp, buf, buf));

            mbedtls_aes_xts_free(&ctx);
        }
    }
#endif
#if defined(MBEDTLS_GCM_C)
    if (todo.aes_gcm)
    {
        int keysize;
        mbedtls_gcm_context gcm;

        mbedtls_gcm_init(&gcm);
        for (keysize = 128; keysize <= 256; keysize += 64)
        {
#ifdef MBEDTLS_AES_ALT_NO_192
            if (keysize == 192)
            {
                continue;
            }
#endif
#ifdef MBEDTLS_AES_ALT_NO_256
            if (keysize == 256)
            {
                continue;
            }
#endif
            mbedtls_snprintf(title, sizeof(title), "AES-GCM-%d", keysize);

            memset(buf, 0, sizeof(buf));
            memset(tmp, 0, sizeof(tmp));
            mbedtls_gcm_setkey(&gcm, MBEDTLS_CIPHER_ID_AES, tmp, keysize);

            TIME_AND_TSC(title, mbedtls_gcm_crypt_and_tag(&gcm, MBEDTLS_GCM_ENCRYPT, BUFSIZE, tmp, 12, NULL, 0, buf,
                                                          buf, 16, tmp));

            mbedtls_gcm_free(&gcm);
        }
    }
#endif
#if defined(MBEDTLS_CCM_C)
    if (todo.aes_ccm)
    {
        int keysize;
        mbedtls_ccm_context ccm;

        mbedtls_ccm_init(&ccm);
        for (keysize = 128; keysize <= 256; keysize += 64)
        {
#ifdef MBEDTLS_AES_ALT_NO_192
            if (keysize == 192)
            {
                continue;
            }
#endif
#ifdef MBEDTLS_AES_ALT_NO_256
            if (keysize == 256)
            {
                continue;
            }
#endif
            mbedtls_snprintf(title, sizeof(title), "AES-CCM-%d", keysize);

            memset(buf, 0, sizeof(buf));
            memset(tmp, 0, sizeof(tmp));
            mbedtls_ccm_setkey(&ccm, MBEDTLS_CIPHER_ID_AES, tmp, keysize);

            TIME_AND_TSC(title, mbedtls_ccm_encrypt_and_tag(&ccm, BUFSIZE, tmp, 12, NULL, 0, buf, buf, tmp, 16));

            mbedtls_ccm_free(&ccm);
        }
    }
#endif
#if defined(MBEDTLS_CHACHAPOLY_C)
    if (todo.chachapoly)
    {
        mbedtls_chachapoly_context chachapoly;

        mbedtls_chachapoly_init(&chachapoly);
        memset(buf, 0, sizeof(buf));
        memset(tmp, 0, sizeof(tmp));

        mbedtls_snprintf(title, sizeof(title), "ChaCha20-Poly1305");

        mbedtls_chachapoly_setkey(&chachapoly, tmp);

        TIME_AND_TSC(title, mbedtls_chachapoly_encrypt_and_tag(&chachapoly, BUFSIZE, tmp, NULL, 0, buf, buf, tmp));

        mbedtls_chachapoly_free(&chachapoly);
    }
#endif
#if defined(MBEDTLS_CMAC_C)
    if (todo.aes_cmac)
    {
        unsigned char output[16];
        const mbedtls_cipher_info_t *cipher_info;
        mbedtls_cipher_type_t cipher_type;
        int keysize;

