Masmiseim36/nxpSDK/boards/mimxrt685audevk/mbedtls3x_examples/mbedtls3x_benchmark/benchmark.c
        const unsigned char *dhm_G[] = {dhm_G_2048, dhm_G_3072};
        const size_t dhm_G_size[]    = {sizeof(dhm_G_2048), sizeof(dhm_G_3072)};

        mbedtls_dhm_context dhm;
        size_t olen;
        size_t n;
        for (i = 0; (size_t)i < sizeof(dhm_sizes) / sizeof(dhm_sizes[0]); i++)
        {
            mbedtls_dhm_init(&dhm);

            if (mbedtls_mpi_read_binary(&dhm.P, dhm_P[i], dhm_P_size[i]) != 0 ||
                mbedtls_mpi_read_binary(&dhm.G, dhm_G[i], dhm_G_size[i]) != 0)
            {
                mbedtls_exit(1);
            }

            n = mbedtls_mpi_size(&dhm.P);
            mbedtls_dhm_make_public(&dhm, (int)n, buf, n, myrand, NULL);
            if (mbedtls_mpi_copy(&dhm.GY, &dhm.GX) != 0)
                mbedtls_exit(1);

            mbedtls_snprintf(title, sizeof(title), "DHE-%d", dhm_sizes[i]);
            TIME_PUBLIC(title, "handshake", ret |= mbedtls_dhm_make_public(&dhm, (int)n, buf, n, myrand, NULL);
                        ret |= mbedtls_dhm_calc_secret(&dhm, buf, sizeof(buf), &olen, myrand, NULL));

            mbedtls_snprintf(title, sizeof(title), "DH-%d", dhm_sizes[i]);
            TIME_PUBLIC(title, "handshake",
                        ret |= mbedtls_dhm_calc_secret(&dhm, buf, sizeof(buf), &olen, myrand, NULL));

            mbedtls_dhm_free(&dhm);
        }
    }
#endif

#if defined(MBEDTLS_ECDSA_C) && defined(MBEDTLS_SHA256_C)
    if (todo.ecdsa)
    {
        mbedtls_ecdsa_context ecdsa;
        const mbedtls_ecp_curve_info *curve_info;
        size_t sig_len;

        memset(buf, 0x2A, sizeof(buf));

        for (curve_info = curve_list; curve_info->grp_id != MBEDTLS_ECP_DP_NONE; curve_info++)
        {
            if (!mbedtls_ecdsa_can_do(curve_info->grp_id))
                continue;

            mbedtls_ecdsa_init(&ecdsa);

            if (mbedtls_ecdsa_genkey(&ecdsa, curve_info->grp_id, myrand, NULL) != 0)
                mbedtls_exit(1);
            ecp_clear_precomputed(&ecdsa.grp);

            mbedtls_snprintf(title, sizeof(title), "ECDSA-%s", curve_info->name);
            TIME_PUBLIC(title, "sign",
                        ret = mbedtls_ecdsa_write_signature(&ecdsa, MBEDTLS_MD_SHA256, buf, curve_info->bit_size, tmp,
                                                            sizeof(tmp), &sig_len, myrand, NULL));

            mbedtls_ecdsa_free(&ecdsa);
        }

        for (curve_info = curve_list; curve_info->grp_id != MBEDTLS_ECP_DP_NONE; curve_info++)
        {
            if (!mbedtls_ecdsa_can_do(curve_info->grp_id))
                continue;

            mbedtls_ecdsa_init(&ecdsa);

            if (mbedtls_ecdsa_genkey(&ecdsa, curve_info->grp_id, myrand, NULL) != 0 ||
                mbedtls_ecdsa_write_signature(&ecdsa, MBEDTLS_MD_SHA256, buf, curve_info->bit_size, tmp, sizeof(tmp),
                                              &sig_len, myrand, NULL) != 0)
            {
                mbedtls_exit(1);
            }
            ecp_clear_precomputed(&ecdsa.grp);

            mbedtls_snprintf(title, sizeof(title), "ECDSA-%s", curve_info->name);
            TIME_PUBLIC(title, "verify",
                        ret = mbedtls_ecdsa_read_signature(&ecdsa, buf, curve_info->bit_size, tmp, sig_len));

            mbedtls_ecdsa_free(&ecdsa);
        }
    }
#endif

#if defined(MBEDTLS_ECDH_C) && defined(MBEDTLS_ECDH_LEGACY_CONTEXT)
    if (todo.ecdh)
    {
        mbedtls_ecdh_context ecdh;
        mbedtls_mpi z;
        const mbedtls_ecp_curve_info montgomery_curve_list[] = {
#if defined(MBEDTLS_ECP_DP_CURVE25519_ENABLED)
            {MBEDTLS_ECP_DP_CURVE25519, 0, 0, "Curve25519"},
#endif
#if defined(MBEDTLS_ECP_DP_CURVE448_ENABLED)
            {MBEDTLS_ECP_DP_CURVE448, 0, 0, "Curve448"},
#endif
            {MBEDTLS_ECP_DP_NONE, 0, 0, 0}
        };
        const mbedtls_ecp_curve_info *curve_info;
        size_t olen;
        const mbedtls_ecp_curve_info *selected_montgomery_curve_list = montgomery_curve_list;

        if (curve_list == (const mbedtls_ecp_curve_info *)&single_curve)
        {
            mbedtls_ecp_group grp;
            mbedtls_ecp_group_init(&grp);
            if (mbedtls_ecp_group_load(&grp, curve_list->grp_id) != 0)
                mbedtls_exit(1);
            if (mbedtls_ecp_get_type(&grp) == MBEDTLS_ECP_TYPE_MONTGOMERY)
                selected_montgomery_curve_list = single_curve;
            else /* empty list */
                selected_montgomery_curve_list = single_curve + 1;
            mbedtls_ecp_group_free(&grp);
        }

        for (curve_info = curve_list; curve_info->grp_id != MBEDTLS_ECP_DP_NONE; curve_info++)
        {
            if (!mbedtls_ecdh_can_do(curve_info->grp_id))
                continue;

            mbedtls_ecdh_init(&ecdh);

            CHECK_AND_CONTINUE(mbedtls_ecp_group_load(&ecdh.grp, curve_info->grp_id));
            CHECK_AND_CONTINUE(mbedtls_ecdh_make_public(&ecdh, &olen, buf, sizeof(buf), myrand, NULL));
            CHECK_AND_CONTINUE(mbedtls_ecp_copy(&ecdh.Qp, &ecdh.Q));
            ecp_clear_precomputed(&ecdh.grp);

            mbedtls_snprintf(title, sizeof(title), "ECDHE-%s", curve_info->name);
            TIME_PUBLIC(title, "handshake",
                        CHECK_AND_CONTINUE(mbedtls_ecdh_make_public(&ecdh, &olen, buf, sizeof(buf), myrand, NULL));
                        CHECK_AND_CONTINUE(mbedtls_ecdh_calc_secret(&ecdh, &olen, buf, sizeof(buf), myrand, NULL)));
            mbedtls_ecdh_free(&ecdh);
        }

        /* Montgomery curves need to be handled separately */
        for (curve_info = selected_montgomery_curve_list; curve_info->grp_id != MBEDTLS_ECP_DP_NONE; curve_info++)
        {
            mbedtls_ecdh_init(&ecdh);
            mbedtls_mpi_init(&z);

            CHECK_AND_CONTINUE(mbedtls_ecp_group_load(&ecdh.grp, curve_info->grp_id));
            CHECK_AND_CONTINUE(mbedtls_ecdh_gen_public(&ecdh.grp, &ecdh.d, &ecdh.Qp, myrand, NULL));

            mbedtls_snprintf(title, sizeof(title), "ECDHE-%s", curve_info->name);
            TIME_PUBLIC(
                title, "handshake",
                CHECK_AND_CONTINUE(mbedtls_ecdh_gen_public(&ecdh.grp, &ecdh.d, &ecdh.Q, myrand, NULL));
                CHECK_AND_CONTINUE(mbedtls_ecdh_compute_shared(&ecdh.grp, &z, &ecdh.Qp, &ecdh.d, myrand, NULL)));

            mbedtls_ecdh_free(&ecdh);
            mbedtls_mpi_free(&z);
        }

        for (curve_info = curve_list; curve_info->grp_id != MBEDTLS_ECP_DP_NONE; curve_info++)
        {
            if (!mbedtls_ecdh_can_do(curve_info->grp_id))
                continue;

            mbedtls_ecdh_init(&ecdh);

